In [7]:
import numpy as np
import pandas as pd

In [9]:
from numpy.random import randn
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [21]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [15]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df['O'] = df['W'] + df['Z']

In [23]:
df

          W         X         Y         Z         O
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [27]:
df.drop('E')

          W         X         Y         Z         O
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [31]:
df

          W         X         Y         Z         O
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [53]:
df.drop('O')

KeyError: "['O'] not found in axis"

In [33]:
df

          W         X         Y         Z         O
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [35]:
df.drop('O',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z         O
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [39]:
df.drop('O',axis=1,inplace=True)

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [47]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df.loc['C','Y']

0.5288134940893595

In [55]:
df.loc[['B','D'],['W','Y']]

          W         Y
B  0.651118 -0.848077
D  0.188695 -0.933237

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [63]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df[df>0]['X']

A    0.628133
B         NaN
C    0.740122
D         NaN
E    1.978757
Name: X, dtype: float64

In [67]:
df[df>0].loc['B']

W    0.651118
X         NaN
Y         NaN
Z    0.605965
Name: B, dtype: float64

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [75]:
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [77]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df[df['W']>0][['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
D  0.955057 -0.758872
E  0.683509  1.978757

In [87]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
df[(df['W']>0) & (df['X']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [110]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [112]:
df.reset_index()['index']

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [122]:
df.reset_index()[['X','index']]

          X index
0  0.628133     A
1 -0.319318     B
2  0.740122     C
3 -0.758872     D
4  1.978757     E

In [130]:
df['States'] = 'WB TN KA MH DL'.split()

In [132]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     WB
B  0.651118 -0.319318 -0.848077  0.605965     TN
C -2.018168  0.740122  0.528813 -0.589001     KA
D  0.188695 -0.758872 -0.933237  0.955057     MH
E  0.190794  1.978757  2.605967  0.683509     DL

In [134]:
df.set_index('States')

               W         X         Y         Z
States
WB      2.706850  0.628133  0.907969  0.503826
TN      0.651118 -0.319318 -0.848077  0.605965
KA     -2.018168  0.740122  0.528813 -0.589001
MH      0.188695 -0.758872 -0.933237  0.955057
DL      0.190794  1.978757  2.605967  0.683509

In [140]:
df.set_index('States')['W']

States
WB    2.706850
TN    0.651118
KA   -2.018168
MH    0.188695
DL    0.190794
Name: W, dtype: float64

In [142]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     WB
B  0.651118 -0.319318 -0.848077  0.605965     TN
C -2.018168  0.740122  0.528813 -0.589001     KA
D  0.188695 -0.758872 -0.933237  0.955057     MH
E  0.190794  1.978757  2.605967  0.683509     DL

In [160]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [164]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [166]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [170]:
df = pd.DataFrame(randn(6,3),hier_index,['A','B','C'])

In [172]:
df

             A         B         C
G1 1  0.484752 -0.116773  1.901755
   2  0.238127  1.996652 -0.993263
   3  0.196800 -1.136645  0.000366
G2 1  1.025984 -0.156598 -0.031579
   2  0.649826  2.154846 -0.610259
   3 -0.755325 -0.346419  0.147027

In [180]:
df.loc['G2'].loc[2]['B']

2.154846443259472

In [182]:
df.index.names

FrozenList([None, None])

In [184]:
df.index.names = ['Group','Num']

In [194]:
df

                  A         B         C
Group Num
G1    1    0.484752 -0.116773  1.901755
      2    0.238127  1.996652 -0.993263
      3    0.196800 -1.136645  0.000366
G2    1    1.025984 -0.156598 -0.031579
      2    0.649826  2.154846 -0.610259
      3   -0.755325 -0.346419  0.147027

In [196]:
df.loc['G2']

            A         B         C
Num
1    1.025984 -0.156598 -0.031579
2    0.649826  2.154846 -0.610259
3   -0.755325 -0.346419  0.147027

In [198]:
df.xs('G2')

            A         B         C
Num
1    1.025984 -0.156598 -0.031579
2    0.649826  2.154846 -0.610259
3   -0.755325 -0.346419  0.147027

In [200]:
df

                  A         B         C
Group Num
G1    1    0.484752 -0.116773  1.901755
      2    0.238127  1.996652 -0.993263
      3    0.196800 -1.136645  0.000366
G2    1    1.025984 -0.156598 -0.031579
      2    0.649826  2.154846 -0.610259
      3   -0.755325 -0.346419  0.147027

In [206]:
df.xs(2,level='Num')

              A         B         C
Group
G1     0.238127  1.996652 -0.993263
G2     0.649826  2.154846 -0.610259

In [208]:
pwd

'/Users/das'